Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "/home/atlantis/infracost_atlantis_diff.sh" in "/home/atlantis/.atlantis/repos/ajinkya101/infracost-azure-atlantis/2/default": 


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_app_service_plan.elastic will be created
+ resource "azurerm_app_service_plan" "elastic" {
      + id                           = (known after apply)
      + kind                         = "elastic"
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "api-appserviceplan-pro"
      + reserved                     = false
      + resource_group_name          = "DEV-RG1"

      + sku {
          + capacity = 1
          + size     = "EP2"
          + tier     = "Basic"
        }
    }

  # azurerm_linux_virtual_machine.my_vm will be created
+ resource "azurerm_linux_virtual_machine" "my_vm" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "fakeuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = "atlantis-test2"
      + network_interface_ids           = [
          + "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/testrg/providers/Microsoft.Network/networkInterfaces/fakenic",
        ]
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "DEV-RG1"
      + size                            = "Standard_B2ms"
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>

